{
  "At intersections, crosswalks, and railroad crossings, you should always:": "Look to the sides of your vehicle to see what is coming.",
  "A large truck is ahead of you and is turning right onto a street with two lanes in each direction. The truck:": "May have to swing wide to complete the right turn.",
  "A police officer is signaling you to drive to the edge of the roadway. You decide to ignore the officer's warning and flee the scene. You are guilty of a misdemeanor and can be punished by being:": "Jailed in the country jail for not more than one year",
  "A school bus ahead of you in your lane is stopped with red lights flashing. You should:": "Stop as long as the red lights are flashing",
  "A solid yellow line next to a broken yellow line means that vehicles:": "Next to the broken line may pass.",
  "A U-turn is not permitted:": "On or near any curve or hill.",
  "A white painted curb indicates a:": "Loading zone for passengers or mail only",
  "After passing a car, it is safe to return to your driving lane when:": "You can see both headlights of the car you just passed in your rearview mirror",
  "All of the following practices are dangerous to do while driving. Which of these is also illegal?": "Listening to music through headphones that cover both ears.",
  "Always stop before you cross railroad tracks when:": "You don't have room on the other side to completely cross the tracks.",
  "Another car creates a hazardous situation by suddenly cutting in front of you. What action should you take first?": "Take your foot off the gas",
  "At a four way stop, if two vehicles are facing each other and are traveling straight through the intersection ___": "both vehicles can go at the same time.",
  "At a four way stop, the first vehicle to arrive at the intersection ___": "should be the first to leave",
  "At a four way stop, when two vehicles reach the intersection at the same time ___": "the driver of the vehicle on left must yield to the driver of the vehicle on the right",
  "At a red traffic light with a green arrow, you may proceed in the direction of the arrow if:": "You are in the proper lane and the roadway is clear.",
  "At an intersection controlled by a \"STOP\" sign, what must you do?": "you must come to a complete stop and check for pedestrians and cross traffic. Yield to other traffic going through the intersection and any pedestrians crossing the street.",
  "At intersections where two or more drivers stop at STOP signs at the same time and they are at right angles, which driver yields?": "the driver on the left must yield the right-of-way to the driver on the right.",
  "Based on the DMV handbook, you should never park your vehicle within __ feet of a fire hydrant.": "15 feet",
  "Define blind intersection": "an intersection in which your view of traffic on an intersecting road is impeded",
  "Blue traffic signs offer information on:": "Motorist services",
  "California's \"Basic Speed Law\" says you must:": "Never drive faster than is safe for current conditions",
  "California's \"Basic Speed Law\" states that:": "You should not drive faster than is safe given the weather and vehicle conditions",
  "Define this sign: Cross Road": "One of the intersection traffic signs. Another road crosses the highway ahead. Look left and right for other traffic. Be alert for cross-traffic and regulatory signals.",
  "Define this sign: Divided Highway Begins": "The highway ahead is split into two separate roadways by a median or divider and each roadway is one-way. Keep to the right.",
  "Define this sign: Divided Highway Ends": "The divided highway on which you are traveling ends 350 to 500 feet ahead. You will then be on a roadway with two-way traffic. Keep to the right of approaching traffic.",
  "Define this sign: DO NOT ENTER sign": "is usually installed at the beginning of one-way streets and ramps and it prohibits drivers from entering a one-way roadway where traffic is moving in the opposite direction. A DO NOT ENTER traffic sign is usually installed together with the \"WRONG WAY\" sign.",
  "During the first 12 months as a newly license driver, you must be accompanied by your parent guardian if you:": "Transport minors between the hours of 11:00 PM and 5:00 A.M",
  "Excessive speed:": "Often leads to high-risk decision-making",
  "Flash your brake lights or turn on your emergency flashers if you:": "Need to warn other drivers of an accident ahead",
  "Define this sign: Four Way Stop": "This road sign is placed at four-way stop intersections and informs drivers that all entrances to this intersection are controlled by stop signs.",
  "Freeway lanes that are ending will usually be marked by": "large broken lines painted on the pavement. If you are driving in a lane marked with these broken lines, be prepared to exit the freeway or for the lane to end.",
  "Generally speaking, you are in a large truck's blind spot if you:": "Cannot see the truck driver in the truck's side mirrors",
  "Define this sign: Guide signs": "These signs are square or rectangular shaped and are blue, green, or brown with white lettering. They tell drivers what services are available in the area.",
  "Having a driver license is a:": "Privilege, not a right",
  "Highway pavement will be particularly treacherous and most slippery:": "If it has just begun to rain",
  "How does a solid red traffic light differ from a red arrow traffic light": "You are not allowed to turn on a red arrow after stopping",
  "If it starts to rain on a hot day, the road is slippery ___": "For the first few minutes",
  "If the roadway is wet and your vehicles starts to skid, you should:": "Slowly ease your foot off the gas pedal",
  "If weather or light conditions require you to have your lights on while driving:": "Use your low beams",
  "If you are being followed too closely on a two-lane road:": "Reduce your speed slowly to encourage the tailgater to drive around you",
  "If you are convicted of driving under the influence, you may be sentenced to:": "Serve up to six months in jail",
  "If you are driving on a highway next to a single broken white line marking": "You may cross the line to pass and change lanes",
  "If you are involved in a traffic collision, you are required to complete and submit a written report (SR1) to the DMV:": "If there is property damage in excess of $1,000 or if there are any injuries.",
  "If you arrive at an intersection when the traffic light is not functioning, you should:": "Come to a complete stop and proceed when it is safe to do so",
  "If you drive faster than other vehicles on a road with one lane in each direction and continually pass the other cars, you will:": "Increase your chances of an accident.",
  "If you have a green light, but traffic is blocking the intersection, you should:": "Stay out of the intersection until traffic clears.",
  "If you have trouble seeing other vehicles because of the dust or smoke on the road, you should slow down and turn on your:": "Front lights",
  "If you miss your exit on the freeway, you should not:": "Back up on the road or shoulder.",
  "If you plan to pass another vehicle, you should:": "Not assume the other driver will make space for you to return to your lane",
  "If you want to pass a bicyclist riding on the right edge of your lane, you:": "Must sound your horn before passing the bicyclist",
  "If you want to pass a bicyclists riding on the edge of your lane:": "You must not squeeze pass the bicyclist",
  "If your vehicle starts to lose traction because of water on the road, you should:": "Slow down gradually and not apply the breaks",
  "If your wheels drop off the roadway or pavement edge, you should:": "Wait until it is safe to do so, then gradually re-enter the roadway",
  "In which of the following scenarios should your wheel not be pointed straight ahead?": "When parked on a hill or sloping driveway",
  "Why do you increase your following distance when driving behind a large vehicle?": "To better see around the sides of the vehicle.",
  "It is a very windy day. You are driving and a dust storm blows across the freeway reducing your visibility. You should drive slower and turn on your:": "Headlights.",
  "It is illegal for a person 21 years of age or older to drive with a blood alcohol concentration (BAC) that is __ or higher": "0.08%-- Eight-hundredths of one percent",
  "It is illegal to leave a child __ years or younger unattended in a motor vehicle.": "Six",
  "It is illegal to park your vehicle:": "In an unmarked crosswalk",
  "Kaitlyn's Law, California Vehicle Code section 15620(a)": "prohibits anyone from leaving a child six years of age or younger unattended in a motor vehicle without the supervision of someone at least 12 years of age or older.",
  "Define this sign: Lane Ends Ahead": "Lane ends ahead. This sign is used on multi-lane highways to warn you of a reduction in the number of traffic lanes in the direction you are traveling. Be prepared to change lanes or to allow other vehicles to merge into your lane.",
  "Define this sign: Lane ends, merge left sign": "two lanes of cars will soon become one lane of cars. The right lane must merge to the left yielding to traffic driving in the left lane.",
  "Large trucks are most likely to lose speed and cause a hazard:": "Going up long steep hills",
  "Large trucks turning right onto a street with two lanes in each direction:": "Often have to use a portion of left lane to complete the turn",
  "Define this sign: Left Curve sign": "The roadway ahead curves to the left. Slow your speed and keep well to the right.",
  "Make room for cars that are entering the freeway by:": "Merging into a different lane",
  "Making a U-turn in residential districts is legal": "When there are no vehicles approaching",
  "Define this sign: Merging Traffic": "Merging traffic. Traffic may be merging into your lane from another roadway. Be ready to either changes lanes or allow other traffic to merge into your lane.",
  "Define this sign: no left turn": "You may not turn left",
  "Define this sign: no right turn": "Right turns are illegal. Do not make a right turn when you see this sign.",
  "Define this sign: No U-Turn": "U-turns are illegal. Do not make a U-turn when you see this sign.",
  "On a green arrow, you must:": "Go but, Yield to any vehicle, bicycle, or pedestrian in the intersection",
  "On rainy, snowy, or foggy days, you should turn on your windshield wipers and": "Use your headlights so other drivers can see you",
  "Parking is never permitted:": "In a crosshatched (diagonal) pattern space",
  "Define this sign: Pedestrian Crossing": "Watch for people crossing the street. Slow down or stop if necessary. Remember that people crossing the street on the pedestrian crossing have the right of way. Slowing down is important since pedestrians may be obscured by parked vehicles and you may not see them the moment they enter the roadway.",
  "Define this light: Red arrow": "A red arrow means STOP. Remain stopped until the green signal or green arrow appears. Do not turn against a red arrow.\"",
  "Define this light: Red signal light": "STOP. A right turn can be made on a red light only after you stop and yield to pedestrians and vehicles in your path. Do not turn in there is a sign prohibiting it. You may turn left on a red light from a one-way street to another one-way street if there is no sign prohibiting it.",
  "Define this sign: Right Curve sign": "The roadway ahead curves to the right. Slow your speed and keep well to the left.",
  "Roads are the most slippery:": "During the first rain after a dry spell because oil and dust on the road have not previously been washed away.",
  "Define this sign: School Crossing Ahead": "Signs may display horizontal lines indicating the point where a crosswalk exists. School zone crosswalk traffic signs may have a separate downward-pointing arrow plaque, which indicates the actual location of the crosswalk.",
  "Define this sign: school zone sign": "Five-sided sign back on yellow is used only to warn of schools and school crossings. Slow down - school zones have a speed limit you must observe. Watch out for children crossing the street or playing.",
  "Define this sign: Sharp Left Turn": "The road will make a sharp turn to the left. Slow your speed, keep to the left and do not pass other vehicles.",
  "Define this sign: Sharp Right Turn": "The road will make a sharp turn to the right. Slow your speed, keep to the right, and do not pass other vehicles.",
  "Should you always drive slower than other traffic?": "No, you can block traffic when you drive too slowly.",
  "Define this sign: Slippery When Wet": "When pavement is wet, reduce your speed. Do not brake hard or change direction suddenly. Increase the distance between your car and the one ahead of you.",
  "Smoking inside a vehicle with a person younger than 18 years of age is:": "Illegal at all times. In California, it is illegal to smoke in a vehicle at any time when a minor is present.",
  "Define this sign: Stop": "A red-and-white regulatory traffic sign. This is the only octagonal (8-sided) traffic sign, you can easily recognize it by both shape and color.",
  "The \"Three-second rule\" applies to the space____ of your vehicle:": "Ahead",
  "The safest precaution that you can take regarding the use of cellular phones and driving is:": "Use hands-free devices so you can keep both hands on the steering wheel.",
  "The speed limit on a school zone where children are present is ____, unless otherwise posted.": "25 mph",
  "There is no crosswalk and you see a pedestrian crossing your lane ahead. You should:": "Stop and let him/her finish crossing the street.",
  "What is the three second rule": "is a way to measure the distance that you should use as a cushion when following another vehicle. It requires leaving three seconds of space between your vehicle and the vehicle driving in front of you.",
  "To avoid last minute moves, you should be looking down the road to where your vehicle will be in about ______________.": "10 to 15 seconds",
  "To avoid tailgating, drivers should:": "Use the \"three-second rule\"",
  "To make a right turn onto a two-way street from a two-way street, start in the right-hand lane and end in:": "The lane closest to the curb",
  "To turn left from a multilane one-way street onto a one-way street, you should start your turn from:": "The lane closest to the left curb",
  "To turn left from one-way street onto a one-way street, start from:": "The lane closest to the left curb",
  "Define this sign: Traffic Signal Ahead": "This sign warns of traffic signals at the intersection ahead. Slow down; poor visibility is likely and be prepared to come to a complete stop on a red signal.",
  "Two sets of solid double yellow lines spaced 2 feet or more apart:": "May not be crossed for any reason, they are considered a barrier. Do not drive on or over this barrier, make a left turn, or make a U-turn across it, except at designated openings.",
  "Two sets of solid, double, yellow lines that are two or more feet apart:": "May not be crossed for any reason.",
  "Two vehicles approach an uncontrolled \"T\" intersection. One vehicle is on the through road and the other is on the road that ends. Who has the right-of-way at the intersection?": "The vehicle on the through road",
  "Define this sign: Two-Way Traffic Ahead": "Two way traffic ahead. You are leaving a separated one-way roadway and entering a two-way roadway. Also used to remind drivers they are on a two-way road.",
  "U-turns in business districts are:": "Legal at intersections, unless a sign prohibits them",
  "Unless otherwise posted the speed limit in a residential area is ____.": "25 mph",
  "What is a three-point turn?": "The three-point turn is a way of turning a vehicle around in a small space by going forward, turning to one side, then backing up, turning in order to face the other direction, then going forward again. This type of turn is usually done when the road is too narrow for a U-turn.",
  "What is the first thing to do when you make a three-point turn?": "Signal with your right turn signal, then pull over to the right and stop. You should first signal and pull over to the right side of the road. Stay on the side of the road until traffic is clear and you have plenty of room in both directions to perform the 3-point turn. But just as importantly, you start from the far right side of the road to get as much use of the road as possible as you maneuver your vehicle.",
  "What is the first thing you should do if your wheels move off the pavement?": "Ease your foot off the gas pedal and brake gently",
  "What should you do if you see this sign? YIELD": "Prepare to stop if necessary",
  "What type of pavement marking is used to show you which lane you must use for a turn?": "Arrows",
  "When a school bus flashes yellow lights:": "The bus is preparing to stop to let the children off the bust",
  "When being followed by a tailgater, which of the following will help you avoid being hit from behind?": "When being closely followed by a tailgater, you should slow down gradually or merge into another lane to prevent a collision with them.",
  "When can you drive in a bike lane?": "When you are within 200 feet of a cross street where you plan to turn right.",
  "When can you drive using only your parking lights?": "Under no circumstances",
  "When changing lanes, you can check your blind spots by:": "Using the inside rearview mirror. Turning your head and looking over your shoulder.",
  "When driving a car equipped with airbags, you are safest when you:": "Maintain a space of at least 10 inches between you and the steering wheel",
  "When driving at night on a dimly lit street, you should:": "Drive slowly enough so you can stop within the area lighted by your headlights",
  "When driving at night, you should:": "Increase your following distance",
  "When driving in fog, it is best to drive with": "Low beam headlights",
  "When entering traffic after being parked at a curb you:": "Should wait for a large enough gap to get up to the speed of the traffic",
  "When looking ahead of your vehicle while driving, you should:": "Scan your surroundings",
  "When parking on a public road, drivers should:": "Move as far away from traffic as possible.",
  "When parking uphill on a two-way street with no curb, your front wheels should be turned to the": "Turned to the right (away from the street)",
  "How far should your wheels be when parking your vehicle parallel to the curb on a level street?": "Your wheels must be within 18 inches of the curb.",
  "When passing another vehicle, it is safe to return to your lane if you:": "See the vehicle's headlights in your rearview mirror.",
  "When preparing to make a left turn from a two-way street, you should drive:": "Near the centerline",
  "When should you turn on your headlights?": "1/2 hour after sunset and 1/2 hour before sunrise.",
  "When you are merging onto the freeway, you should be driving:": "At or near the same speed as the traffic on the freeway.",
  "When you prepare to make a left turn from a one-way road into a one-way road, you must:": "Approach the turn in the left lane of from the left side of a single lane",
  "When you tailgate other drivers (drive close to their rear bumper):": "You can frustrate the other drivers and make them angry.",
  "Which lane must you be in before making a left turn from a one-way street?": "The lane nearest the left curb",
  "Which of the following is true about the Anti-Lock Brake System?": "It allows drivers to steer during an emergency braking situation and It prevents skidding",
  "What is true when you are moving in a dedicated turn lane controlled by a green arrow light?": "All oncoming vehicles and pedestrians are stopped by red lights",
  "What is true about blind spots?": "Large trucks have bigger blind spots than most passenger vehicles.",
  "What is true about children riding in your vehicle?": "Children under the age of 1 should not ride in the front seat in vehicles equipped with airbags",
  "Which of these vehicles must always stop before crossing railroad tracks?": "Tanks trucks marked with hazardous materials placards",
  "Define this sign: Winding Road": "(SET OF CURVES). This sign indicates there are three (3) or more curves in a row on the road ahead. The sign is frequently accompanied by an advisory speed sign. Slow down to recommended speed before you enter the curves.",
  "With a Class C drivers license a person may drive,": "A 3-axle vehicle if the Gross Vehicle Weight is less than 6,000 pounds",
  "Define this sign: WRONG WAY sign": "You are going the wrong way on an expressway exit ramp or highway. Do not drive past this sign. Turn around immediately.",
  "Define this sign: YIELD right of way sign": "Triangle signs mean yield. You must slow down to a speed that is reasonable for existing conditions and stop if necessary.",
  "You are about to make a left turn. You must signal continuously during the last ____ feet before the turn.": "100feet",
  "You are approaching a railroad crossing with no warning devices and are unable to see 400 feet down the tracks in one direction. The speed limit is:": "15 mph",
  "You are approaching an intersection where a traffic signal is displaying a steady yellow light. If you have not already entered the intersection, you should:": "Come to a safe spot",
  "You are approaching an intersection where the traffic signal is flashing red. You should:": "Stop before entering the intersection and proceed when it is safe to do so",
  "You are driving on a freeway posted for 65 mph. Most of the other vehicles are driving 70 mph or faster. You may legally drive:": "No faster than 65 mph.",
  "You are driving on a one-way street. You may turn left onto another one-way street only if:": "Traffic on the street moves to the left.",
  "You are driving on a roadway where vehicles are approaching from the opposite direction on your left and vehicles are parked in a row on your right. You should steer:": "A middle course between the oncoming traffic and the parked cars",
  "You are driving on the freeway. The vehicle in front of you is a large truck. You should drive:": "Farther behind the truck than you would for a passenger vehicle.",
  "You are driving on the right edge of the lane of a four-lane highway and you see thick white lines on the left side of your lane. You are driving on an ___": "exit lane",
  "You are entering a roundabout with multiple lanes, and you need to turn left at the intersection. You must:": "Choose the left-land lane and exit",
  "You are getting ready to make a right turn. You should:": "Slow down or stop, if necessary, and then make the turn.",
  "You are planning to make a left turn from a dedicated left-turn lane when the light turns to a yellow arrow. You should:": "Be prepared to obey the next signal that appears",
  "You are preparing to exit the interstate. When should you start reducing your speed?": "Immediately upon entering the deceleration lane",
  "You are reaching an intersection, and trees block your view to the side for the last 100 feet before crossing. The intersection is considered:": "A \"blind intersection\"",
  "You drive defensively when you:": "Keep your eyes moving to look for possible hazards",
  "You have been involved in a minor traffic collision with a parked vehicle and you can't find the owner. You must:": "Leave a note on the vehicle or Report the collision without delay to the city police or, in unincorporated areas, to the California highway patrol.",
  "You just sold your vehicle. You must notify the DMV within ___ days.": "5 days",
  "You may cross a double yellow line to pass another vehicle, if the yellow line next to:": "Your side of the road is a broken line.",
  "You may drive off of the paved roadway to pass another vehicle:": "Under no circumstances.",
  "You may legally block an intersection:": "Under no circumstances",
  "You may not park your vehicle:": "Next to a red painted curb",
  "You may not turn left onto a one-way street where traffic": "moves to the right.",
  "You may turn left onto a one-way street that moves to the left if": "there is no sign prohibiting the turn.",
  "You must come to a full stop at a yield sign if ,": "If traffic conditions require it.",
  "You must give the right of way to any pedestrian who is:": "Crossing any street",
  "You must leave an additional \"mattress\" space": "When following a driver whose rear vision is obstructed",
  "You must obey instructions from school crossing guards:": "At all times.",
  "You must yield the right-of-way to an emergency vehicle that is using its siren and flashing lights by:": "Driving as closely to the right edge of the road as possible and stopping.",
  "You see a flashing yellow traffic signal at an upcoming intersection. The flashing yellow light means:": "Slow down and cross the intersection carefully.",
  "You see a signal person at a road construction site ahead. You should obey his or her instructions:": "At all times.",
  "You should always travel:": "At a speed appropriate for road and weather conditions.",
  "You should not use your horn:": "Near blind pedestrians: When driving near a blind pedestrian, using your horn may be dangerous. Yield to the pedestrian and proceed when it is safe to do so.",
  "You want to make a right turn at an upcoming intersection. You should slow down and:": "Signal for 100 feet before turning.",
  "You were parked and have been waiting a long time with your turn signal on to re-enter traffic. However, traffic is heavy. You should:": "Continue waiting and yielding to traffic in the lane",
  "Your blood alcohol content (BAC) depends on what:": "How much alcohol you drink, how much time passes between drinks, and your weight."
}